In [4]:
import numpy as np
import pandas as pd

In [5]:
data={
    "name":["Alice","Bob","Charlie"],
    "Age":[25,30,35]
}

In [6]:
df=pd.DataFrame(data,index=["a","b","c"])

In [7]:
df

      name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [8]:
df.reindex(["c","a","b"])

      name  Age
c  Charlie   35
a    Alice   25
b      Bob   30

In [9]:
df.reindex(["c","a","b","p"])

      name   Age
c  Charlie  35.0
a    Alice  25.0
b      Bob  30.0
p      NaN   NaN

In [10]:
df.reindex(["p","q","r"])

  name  Age
p  NaN  NaN
q  NaN  NaN
r  NaN  NaN

In [11]:
df.reindex(columns=["Age","Name"])

   Age  Name
a   25   NaN
b   30   NaN
c   35   NaN

In [12]:
df

      name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

Rename index and columns

In [13]:
df.rename(index={"a":"p","c":"q"},columns={"Name":"First name","Age":"Current age"})

      name  Current age
p    Alice           25
b      Bob           30
q  Charlie           35

In [14]:
df

      name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [15]:
#Directly replace index or columns labels :

In [16]:
df.index=["x","y","z"]

In [17]:
df.columns=["person name","person age"]

In [18]:
df

  person name  person age
x       Alice          25
y         Bob          30
z     Charlie          35

In [19]:
print(df.index)

Index(['x', 'y', 'z'], dtype='object')

In [20]:
print(df.columns)

Index(['person name', 'person age'], dtype='object')

In [21]:
df.reset_index(inplace=True)

In [22]:
df

  index person name  person age
0     x       Alice          25
1     y         Bob          30
2     z     Charlie          35

In [23]:
df.drop(columns=["index"],inplace=True)

In [24]:
df

  person name  person age
0       Alice          25
1         Bob          30
2     Charlie          35

Pivoting :

In [25]:
data={
    "Date":["2024-01-01","2024-01-01","2024-01-02","2024-01-02"],
    "Product":["Laptop","Mouse","Laptop","Mouse"],
    "Sales":[1200,100,1300,120]
}

df=pd.DataFrame(data)

In [26]:
df

         Date Product  Sales
0  2024-01-01  Laptop   1200
1  2024-01-01   Mouse    100
2  2024-01-02  Laptop   1300
3  2024-01-02   Mouse    120

In [27]:
# df.pivot(index="Date",columns="Product",values="Sales")
df.pivot(index="Date", columns="Product", values="Sales")

Product     Laptop  Mouse
Date
2024-01-01    1200    100
2024-01-02    1300    120

In [28]:
df

         Date Product  Sales
0  2024-01-01  Laptop   1200
1  2024-01-01   Mouse    100
2  2024-01-02  Laptop   1300
3  2024-01-02   Mouse    120

In [29]:
df.pivot(index="Product",columns="Date",values="Sales")

Date     2024-01-01  2024-01-02
Product
Laptop         1200        1300
Mouse           100         120

In [30]:
df.pivot_table(index="Date",columns="Product",values="Sales")

Product     Laptop  Mouse
Date
2024-01-01  1200.0  100.0
2024-01-02  1300.0  120.0

In [31]:
df

         Date Product  Sales
0  2024-01-01  Laptop   1200
1  2024-01-01   Mouse    100
2  2024-01-02  Laptop   1300
3  2024-01-02   Mouse    120

In [32]:
df.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="sum")

Product     Laptop  Mouse
Date
2024-01-01    1200    100
2024-01-02    1300    120

In [33]:
data2={
    "Data":["2024-01-01","2024-01-01","2024-01-02","2024-01-02","2024-01-01","2024-01-02"],
    "Product":["Laptop","Mouse","Laptop","Mouse","Laptop","Mouse"],
    "Sales":[1200,100,1300,120,560,320]
}

df2=pd.DataFrame(data2)

In [34]:
df2

         Data Product  Sales
0  2024-01-01  Laptop   1200
1  2024-01-01   Mouse    100
2  2024-01-02  Laptop   1300
3  2024-01-02   Mouse    120
4  2024-01-01  Laptop    560
5  2024-01-02   Mouse    320

In [35]:
df.pivot_table(index="Date",columns="Product",values="Sales")

Product     Laptop  Mouse
Date
2024-01-01  1200.0  100.0
2024-01-02  1300.0  120.0

In [36]:
df.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="mean")

Product     Laptop  Mouse
Date
2024-01-01  1200.0  100.0
2024-01-02  1300.0  120.0

In [37]:
df.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="sum")

Product     Laptop  Mouse
Date
2024-01-01    1200    100
2024-01-02    1300    120

In [38]:
df_trans=pd.read_csv("transactions.csv")
# df=pd.read_csv("transactions.csv")
# df

In [39]:
# df_trans.pivot_table(index="Category",columns="name",values="amount",aggfunc="mean")
df_trans.pivot_table(index="category", columns="name", values="amount", aggfunc="mean")

name      Alice Brown   Bob Wilson  Charlie Davis   John Smith
category
A         1013.098322  1007.145509     978.734140  1016.928494
B          995.399100  1001.289501     989.217648  1022.436821
C          987.403818   982.914803    1028.884271   979.868461

In [40]:
pivote_tbl=df_trans.pivot_table(index="category",columns="name",values="amount",aggfunc="mean")

In [41]:
pivote_tbl=df_trans.pivot_table(index="category",columns="name",values="amount",aggfunc="sum")

In [42]:
pivote_tbl

name        Alice Brown     Bob Wilson  Charlie Davis     John Smith
category
A          50654.916080   65464.458093   66553.921547   78303.494025
B          68682.537866   47060.606561   69245.235392   77705.198415
C         131324.707842  105171.883924  132726.070909  111705.004519

In [43]:
print(pivote_tbl["Alice Brown"].sum())

250662.161788

In [44]:
for col in pivote_tbl.columns:print(f"{col}")
{pivote_tbl[col].sum()}

Alice Brown
Bob Wilson
Charlie Davis
John Smith

{np.float64(267713.696959)}

group by () function :

In [45]:
data={
    "Department":["IT","HR","Finance","IT","HR","Finance"],
    "Employee":["A","B","C","D","E","F"],
    "Salary":[60000,65000,50000,52000,70000,71000]
}

In [46]:
df_hr=pd.DataFrame(data)

In [47]:
df_hr

  Department Employee  Salary
0         IT        A   60000
1         HR        B   65000
2    Finance        C   50000
3         IT        D   52000
4         HR        E   70000
5    Finance        F   71000

In [48]:
df_hr.groupby(by="Department")

In [49]:
df_hr.groupby(by="Department")["Salary"]

In [50]:
df_hr.groupby("Department")["Salary"].sum()

Department
Finance    121000
HR         135000
IT         112000
Name: Salary, dtype: int64

In [51]:
df_hr.groupby("Department")["Salary"].mean()

Department
Finance    60500.0
HR         67500.0
IT         56000.0
Name: Salary, dtype: float64

In [52]:
df_hr.groupby(["Department","Employee"])["Salary"].mean()

Department  Employee
Finance     C           50000.0
            F           71000.0
HR          B           65000.0
            E           70000.0
IT          A           60000.0
            D           52000.0
Name: Salary, dtype: float64

In [53]:
df_hr.groupby("Department")["Salary"].agg(["sum","mean","count"])

               sum     mean  count
Department
Finance     121000  60500.0      2
HR          135000  67500.0      2
IT          112000  56000.0      2

In [54]:
df_hr.groupby("Department")["Salary"].agg(Total_sum="sum",Avg="mean",Count="count")

            Total_sum      Avg  Count
Department
Finance        121000  60500.0      2
HR             135000  67500.0      2
IT             112000  56000.0      2

In [55]:
# Using groupby ().apply with custom function
df=pd.DataFrame({
    "Team":["A","A","B","B","C","C"],
    "Player":["p1","p2","p3","p4","p5","p6"],
    "score":[15,18,10,25,20,23]
})

In [56]:
df

  Team Player  score
0    A     p1     15
1    A     p2     18
2    B     p3     10
3    B     p4     25
4    C     p5     20
5    C     p6     23

In [57]:
# df score_diff(x):
# def score_diff(x):
    # return x["Score1"] - x["Score2"]

def score_diff(x):
    return x.max() - x.min()

ans=df.groupby("Team")["score"].apply(score_diff)
ans

Team
A     3
B    15
C     3
Name: score, dtype: int64

In [58]:
df

  Team Player  score
0    A     p1     15
1    A     p2     18
2    B     p3     10
3    B     p4     25
4    C     p5     20
5    C     p6     23

In [59]:
# Fitter groups with team total score > 35
total_score=df.groupby("Team")["score"].sum()
high_score_teams=total_score[total_score>35].index
filtered_df=df[df["Team"].isin(high_score_teams)]
filtered_df

  Team Player  score
4    C     p5     20
5    C     p6     23

Transform() functions :

In [60]:
df

  Team Player  score
0    A     p1     15
1    A     p2     18
2    B     p3     10
3    B     p4     25
4    C     p5     20
5    C     p6     23

In [61]:
df["New_score"]=df["score"].transform(lambda x : x+5)

In [62]:
df

  Team Player  score  New_score
0    A     p1     15         20
1    A     p2     18         23
2    B     p3     10         15
3    B     p4     25         30
4    C     p5     20         25
5    C     p6     23         28

In [63]:
def disp(n):
    return n+10

In [ ]:
df["Diff_score"]=df["score"]